Dlubal.RFEM5.RibCrossSection
Rib cross-section parameters

Dlubal.RFEM5.RibCrossSection.RibNo
Rib number

Dlubal.RFEM5.RibCrossSection.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.RibCrossSection.Description
Rib cross-section description

Dlubal.RFEM5.RibCrossSection.Depth
Depth h

Dlubal.RFEM5.RibCrossSection.WebThickness
Web thickness s

Dlubal.RFEM5.RibCrossSection.UpperLeftFlangeWidth
Upper left flange width btl

Dlubal.RFEM5.RibCrossSection.UpperLeftFlangeThickness
Upper left flange thickness ttl

Dlubal.RFEM5.RibCrossSection.UpperLeftChamferWidth
Upper left chamfer width bwtl

Dlubal.RFEM5.RibCrossSection.UpperLeftChamferHeight
Upper left chamfer height hwtl

Dlubal.RFEM5.RibCrossSection.LowerLeftFlangeWidth
Lower left flange width bbl

Dlubal.RFEM5.RibCrossSection.LowerLeftFlangeThickness
Lower left flange thickness tbl

Dlubal.RFEM5.RibCrossSection.LowerLeftChamferWidth
Lower left chamfer width bwbl

Dlubal.RFEM5.RibCrossSection.LowerLeftChamferHeight
Lower left chamfer height hwbl

Dlubal.RFEM5.RibCrossSection.UpperRightFlangeWidth
Upper right flange width btr

Dlubal.RFEM5.RibCrossSection.UpperRightFlangeThickness
Upper right flange thickness ttr

Dlubal.RFEM5.RibCrossSection.UpperRightChamferWidth
Upper right chamfer width bwtr

Dlubal.RFEM5.RibCrossSection.UpperRightChamferHeight
Upper right chamfer height hwtr

Dlubal.RFEM5.RibCrossSection.LowerRightFlangeWidth
Lower right flange width bbr

Dlubal.RFEM5.RibCrossSection.LowerRightFlangeThickness
Lower right flange thickness tbr

Dlubal.RFEM5.RibCrossSection.LowerRightChamferWidth
Lower right chamfer width bwbr

Dlubal.RFEM5.RibCrossSection.LowerRightChamferHeight
Lower right chamfer height hwbr

Dlubal.RFEM5.RibCrossSection.Eccentricity
Distance between rib cross-section and original cross-section